ezois_ka/oooezoiskaobmen/src/Documents/ВходящийДокументСЭДОФСС/ВходящийДокументСЭДОФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящийДокументСЭДОФСС</name>
  <comment>Входящий документ ФК &quot;Доходная часть&quot; СЭДО</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайл</name>
    <type>
      <types>CatalogRef.ВходящийДокументСЭДОФССПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИмпорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтветаНаЗапрос</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПолученоФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаОтправкиОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлПодписьСотрудникаФонда</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлПодписьФонда</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьБылНезаполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСФР</name>
    <comment>Значение реквизита regNumSFR</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>Значение реквизита regNumSFR</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПротокола</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиЛогическогоКонтроля</name>
    <attributes>
      <name>ОтветНаТребованиеФСС</name>
      <type>
        <types>DocumentRef.ОтветСтрахователяНаТребованиеПроверкиФСС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщенияОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяПриемаОтказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержимоеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УведомленияОПриемеОтказе</name>
    <attributes>
      <name>ОтветНаТребованиеФСС</name>
      <type>
        <types>DocumentRef.ОтветСтрахователяНаТребованиеПроверкиФСС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщенияПротокола</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияПротокола</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборДокументов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокументовВоВложении</name>
      <comment>Максимальное значение 50000</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыПриложений</name>
    <attributes>
      <name>ВидФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложения</name>
      <type>
        <types>CatalogRef.ВходящийДокументСЭДОФССПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложенияПодписьСотрудникаФонда</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПриложенияПодписьФонда</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ЖурналОтправокВКонтролирующиеОрганы/ЖурналОтправокВКонтролирующиеОрганы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтправокВКонтролирующиеОрганы</name>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПриcоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументовВЖурнале</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтраницаЖурнала</name>
    <type>
      <types>EnumRef.СтраницыЖурналаОтчетность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/ВходящийДокументСЭДОФСС/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Параметры.Ключ.Пустая();
	Если ЭтоНовый Тогда
		ТекстПредупреждения = НСтр("ru = 'Копирование входящих сообщений запрещено!'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	ОтветСтрахователяНаТребованиеПроверкиФСС.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.ОтветСтрахователяНаТребованиеПроверкиФСС КАК ОтветСтрахователяНаТребованиеПроверкиФСС
			               |ГДЕ
			               |	ОтветСтрахователяНаТребованиеПроверкиФСС.Основание = &Основание
			               |	И ОтветСтрахователяНаТребованиеПроверкиФСС.ПометкаУдаления = ЛОЖЬ
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ОтветСтрахователяНаТребованиеПроверкиФСС.Дата УБЫВ";
			
			Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
			
			
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СформированныйОтвет = Выборка.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Организация.Видимость = Не РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация();
	
	ПрефиксИмениФайлаПечатнойФормы = ПрефиксИмениФайлаПечатнойФормы();
	Приложения = ПриложенияКОсновномуДокументу(Объект);
	ЭтаФорма.КоличествоФайловПриложений = Приложения.Количество();
	
	УправлениеФормой(ЭтаФорма);
	
	МассивОтветов = ПолучитьОтветыНаТребованиеФСС(Объект.Ссылка);
	ЭтаФорма.КоличествоОтветовВБазе = МассивОтветов.Количество();
	ЭтаФорма.ОшибкиОтветов = ПолучитьОшибкиОтветов();
		
	Если ЭлектронныйДокументооборотСФСС.ЭтоТребованиеСФРОПредоставленииДокументов(Объект) Тогда
		ОформитьПредставлениеОтвета();
	Иначе
		Элементы.ОтступПередКомментарием.Видимость = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВходящийДокументСЭДОФССПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ВходящийДокументСЭДОФССПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ВходящийДокументСЭДОФССПрисоединенныеФайлы.Размер КАК Размер
	|ИЗ
	|	Справочник.ВходящийДокументСЭДОФССПрисоединенныеФайлы КАК ВходящийДокументСЭДОФССПрисоединенныеФайлы
	|ГДЕ
	|	ВходящийДокументСЭДОФССПрисоединенныеФайлы.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.ВходящийФайл);
		
	Результат = Запрос.Выполнить();
	
	СвойстваВходящегоФайла = Неопределено;
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СвойстваВходящегоФайла = Новый Структура;
			СвойстваВходящегоФайла.Вставить("Наименование",	Выборка.Наименование);
			СвойстваВходящегоФайла.Вставить("Расширение",	Выборка.Расширение);
			СвойстваВходящегоФайла.Вставить("Размер",		Выборка.Размер);
		КонецЕсли;
	КонецЕсли;
	
	Если СвойстваВходящегоФайла = Неопределено Тогда
		Элементы.Вложения.Заголовок = "Файл вложения не найден.";
	Иначе
		Элементы.Вложения.Заголовок = СвойстваВходящегоФайла.Наименование +
		"." + СвойстваВходящегоФайла.Расширение + 
		" (" + Окр(СвойстваВходящегоФайла.Размер / 1024, 2) + "Кб)";
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Ссылка);
	
	ОформитьПредставлениеПодтверждения();
	
	ИнициализироватьВыводСтатусовИВажныхСообщений_85();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаголовокОтветы = "Ответы (" + ПолучитьКоличествоОтветовНаТребованиеФСС(Объект.Ссылка) + ")";
	Элементы.ГиперссылкаОтветы.Заголовок = ЗаголовокОтветы;
	Элементы.ПоказатьОтветы.Заголовок = ЗаголовокОтветы;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Организация)
		И РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации");
		Организация = Модуль.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда
		ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Ответ страхователя на запрос, отправлен" Тогда
		ЭтаФорма.Прочитать();
		Если НЕ ЗначениеЗаполнено(Объект.ДатаОтправкиОтветаНаЗапрос) Тогда
			Объект.ДатаОтправкиОтветаНаЗапрос = ТекущаяДата();
			ЭтаФорма.Прочитать();
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьКлиент.ЭтоСобытиеЗавершениеОтправки(ИмяСобытия) Тогда
		ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздатьОтвет()
	
	СформированныйОтвет = СфомироватьОтветНаСервере(Объект.Ссылка);
	
	Если СформированныйОтвет =
			ПредопределенноеЗначение("Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.ПустаяСсылка")
			ИЛИ СформированныйОтвет = Неопределено Тогда
			
			Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("Ключ", СформированныйОтвет);
	ОткрытьФорму(
		"Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.Форма.ФормаДокумента",
		ПараметрыФормы);
		
	ЗаголовокОтветы = "Ответы (" + ПолучитьКоличествоОтветовНаТребованиеФСС(Объект.Ссылка) + ")";
	Элементы.ПоказатьОтветы.Заголовок = ЗаголовокОтветы;
	
	УправлениеФормой(ЭтаФорма);
	ОформитьПредставлениеПодтверждения();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявлениеНаСправкуОРасчетах(Команда)
	
	ФормаДокумента = "Документ.ЗаявлениеНаФормированиеСправкиОРасчетах.Форма.ФормаДокумента";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",
		Новый Структура("Организация, ДатаЗадолженности", Объект.Организация, НачалоМесяца(ТекущаяДата())));
	
	ОткрытьФорму(ФормаДокумента, ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаПодтвердитьПрием(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьСтрахователя(Объект.ИдентификаторСообщения);
	КонецЕсли;
	
	// Отправка в пределах 6 рабочих дней от даты отправки документа.
	ДокументТребуетОтвета = ДокументТребуетОтвета(Объект.ТипСообщения);
	Если ДокументТребуетОтвета Тогда
		НастройкиВызова = Новый Структура;
		НастройкиВызова.Вставить("БезУчетаПользователя", Истина);
		СвойстваОбменаПоСЭДОЧерезОператора =
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.СвойстваОбменаПоСЭДОЧерезОператора(Объект.Организация, ,
				НастройкиВызова);
		Если ТекущаяДата() <= Объект.МаксимальнаяДатаПодтверждения Тогда
			МаксимальнаяДатаОтвета = МаксимальнаяДатаОтвета(Объект.ВходящаяДата, Объект.МаксимальнаяДатаПодтверждения);
			МаксимальнаяДатаОтветаСтр = Формат(МаксимальнаяДатаОтвета, "ДЛФ=D");
			ТекстВопроса = 
				НСтр("ru='Вы отправляете подтверждение до истечения 6 рабочих дней с даты отправки'")
				+ " " + НСтр("ru='документа фондом, поэтому срок представления ответа будет пересчитан.'")
				+ Символы.ПС + НСтр("ru='При подтверждении сегодня ответ необходимо представить до %1. Продолжить?'");
			ТекстВопроса = СтрШаблон(ТекстВопроса, МаксимальнаяДатаОтветаСтр);
			Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Отправка в позже чем 6 рабочих дней от даты отправки документа.
	Если ДокументТребуетОтвета Тогда
		Если ТекущаяДата() > Объект.МаксимальнаяДатаПодтверждения Тогда
			МаксимальнаяДатаОтветаСтр = Формат(Объект.МаксимальнаяДатаОтправкиОтвета, "ДЛФ=D");
			ТекстВопроса = 
				НСтр("ru='Вы отправляете подтверждение позже 6 рабочих дней после'")
				+ " " + НСтр("ru='отправки документа фондом, поэтому срок ответа не меняется.'")
				+ Символы.ПС + НСтр("ru='Направьте ответ в фонд до %1. Продолжить отправку подтверждения?'");
			ТекстВопроса = СтрШаблон(ТекстВопроса, МаксимальнаяДатаОтветаСтр);
			Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения) Тогда
		Оповещение = Новый ОписаниеОповещения("ПодтвердитьПриемПослеВопросаОПовторе", ЭтотОбъект);
		Шаблон = НСтр("ru='Подтверждение получения было отправлено %1. Отправить повторно?'");
		ТекстВопроса = СтрШаблон(Шаблон, Объект.ДатаОтправкиПодтверждения);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.Отмена);
		Возврат;
	КонецЕсли;
	
	ПодтвердитьПриемПослеВопросаОПовторе(КодВозвратаДиалога.ОК, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуОтвета(Команда)

	ОповещениеЗавершения = Новый ОписаниеОповещения("ИзменитьДатуОтветаЗавершение", ЭтотОбъект);
	ТребованияФНСКлиент.ИзменитьСрокТребования(Объект.Ссылка, ОповещениеЗавершения);
	ТекущийЭлемент = Элементы.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойстваОтветов(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.СвойстваОтветовНаТребованияФСС.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойстваТребования(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияНажатие(Элемент)
	
	ФайлСсылка = ПолучитьФайлПриложения();
		
	ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ФайлСсылка,
		УникальныйИдентификатор, Истина);
		
	ПрефиксИмениФайлаПечатнойФормы = ПрефиксИмениФайлаПечатнойФормы();
	ОшибкаФорматаФайла = Ложь;
	РасширениеPDF = "pdf";
	Если ВРег(ДанныеФайла.Расширение) = ВРег(РасширениеPDF)
		И НЕ ЭлектронныйДокументооборотСФССКлиент.ЭтоФайлPDF(ДанныеФайла) Тогда
		Если СтрНачинаетсяС(ДанныеФайла.Наименование, ПрефиксИмениФайлаПечатнойФормы) Тогда
			// Попытка открытия основного вложения вместо печатной формы.
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(Объект.ВходящийФайл,
				УникальныйИдентификатор, Истина);
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьВложенныйФайл(ДанныеФайла.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияКОсновномуДокументуНажатие(Элемент)
	
	Если КоличествоФайловПриложений = 1 Тогда
		ПриложенияДокумента = ПриложенияКОсновномуДокументу(Объект);
		ПоказатьВложенныйФайл(ПриложенияДокумента[0].СсылкаНаФайл);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму(
		"Документ.ВходящийДокументСЭДОФСС.Форма.ФормаФайлыПриложений",
		ДополнительныеПараметры,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтветыНажатие(Элемент)
	
	НажатиеНаКнопкуПоказатьОтветыПоТребованию();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОтветыНажатие(Элемент)
	
	НажатиеНаКнопкуПоказатьОтветыПоТребованию();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСрокиНажатие(Элемент)
	
	ЭлектронныйДокументооборотСФССКлиент.ПоказатьИнформациюоСроках();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	Форма.Заголовок = Объект.ВидДокументаФСС
		+ " СФР (бывш. ФСС) "
		+ Формат(Объект.ВходящийНомер, "ЧГ=")
		+ " от "
		+ Формат(Объект.ВходящаяДата, "ДФ=dd.MM.yyyy");
	Элементы.НаименованиеЭтапа.Заголовок = Объект.Статус;
	Если Объект.Статус = "" Тогда
		Элементы.НаименованиеЭтапа.Заголовок = "Подтвердите прием";
		Элементы.ОбновитьОтправку.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения) Тогда
			Элементы.НаименованиеЭтапа.Заголовок = "Прием подтвержден";
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Статус = "Подтвердите прием" Тогда
		Элементы.ОбновитьОтправку.Видимость = Ложь;
	КонецЕсли;
	
	Форма.Отправитель = "Орган СФР "+ Объект.Отправитель + " (" + Объект.КодОтправителя + ")";
	
	Если ДокументТребуетОтвета(Объект.ТипСообщения) Тогда
		Элементы.ГруппаЗапрашиваемыеДокументы.Видимость = Истина;
		Элементы.ГруппаОшибокОтвета.Видимость			= Форма.ОшибкиОтветов > 0;
	Иначе
		Элементы.ГиперссылкаОтветы.Видимость			= Ложь;
		Элементы.ПоказатьОтветы.Видимость				= Ложь;
		Элементы.ГруппаЗапрашиваемыеДокументы.Видимость	= Ложь;
		Элементы.ГруппаОтветаНаТребование.Видимость		= Ложь;
		Элементы.ГруппаБезПарсинга.Видимость			= Ложь;
		Элементы.КомандаСоздатьОтвет.Видимость			= Ложь;
	КонецЕсли;
	
	Элементы.БлокОшибокИИзвещений.Видимость = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения) Тогда
		Элементы.БлокОшибокИИзвещений.Видимость = Истина;
	Иначе
		Элементы.БлокОшибокИИзвещений.Видимость = Ложь;
	КонецЕсли;
	
	Если Форма.КоличествоФайловПриложений > 0 Тогда
		Элементы.ГруппаФайлыПриложений.Видимость = Истина;
		Если Форма.КоличествоФайловПриложений = 1 Тогда
			Приложения = ПриложенияКОсновномуДокументу(Объект);
			Элементы.ВложенияКОсновномуДокументу.Заголовок = Приложения[0].ПредставлениеФайла;
		Иначе
			Шаблон = НСтр("ru='Файлы приложений (%1)'");
			ТекстЗаголовка = СтрШаблон(Шаблон, Форма.КоличествоФайловПриложений);
			Элементы.ВложенияКОсновномуДокументу.Заголовок = ТекстЗаголовка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПредставлениеПодтверждения()
	
	Элементы.БлокНеотправленныхИзвещений.Видимость = НЕ ЗначениеЗаполнено(Объект.ДатаОтправкиПодтверждения);
	
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	ТребуетсяПодтверждение = Ложь;
	Если НЕ КонтекстЭДО = Неопределено
		И НЕ ПустаяСтрока(Объект.ТипСообщения) Тогда
		Тип = Число(Объект.ТипСообщения);
		ТребуетсяПодтверждение = КонтекстЭДО.ТребуетсяПодтверждениеТипаСообщенияДоходнойЧастиСЭДО(Тип);
	КонецЕсли;
	
	ДатаОтправкиПодтверждения = Объект.ДатаОтправкиПодтверждения;
	ПодтверждениеОтправлено = ЗначениеЗаполнено(ДатаОтправкиПодтверждения);
	
	СекундВСутках = 24 * 60 * 60;
	Состояние = Новый Структура;
	Состояние.Вставить("Ссылка", Объект.Ссылка);
	Состояние.Вставить("Подтвержден", ПодтверждениеОтправлено);
	Состояние.Вставить("ПодтвердитьДо", Объект.МаксимальнаяДатаПодтверждения);
	
	Если ТребуетсяПодтверждение Тогда
		Если НЕ ПодтверждениеОтправлено Тогда
			Состояние.Вставить("ПодтверждениеПросроченоНа",
				Окр((ТекущаяДатаСеанса() - Объект.МаксимальнаяДатаПодтверждения) / СекундВСутках));
			Состояние.Вставить("ОсталосьДоПодтверждения",
				Окр((Объект.МаксимальнаяДатаПодтверждения - ТекущаяДатаСеанса()) / СекундВСутках));
		Иначе
			Состояние.Вставить("ПодтверждениеПросроченоНа",
				Окр((ДатаОтправкиПодтверждения - Объект.МаксимальнаяДатаПодтверждения) / СекундВСутках));
			Состояние.Вставить("ОсталосьДоПодтверждения",
				Окр((Объект.МаксимальнаяДатаПодтверждения - ДатаОтправкиПодтверждения) / СекундВСутках));
		КонецЕсли;
	Иначе
		Элементы.ДатаПриемаПредставление.Заголовок = НСтр("ru = 'Подтверждение не требуется'");
		Элементы.ОгонекПодтверждения.Видимость = Ложь;
		Элементы.ГруппаЗаголовкаСроков.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Состояние.Вставить("ДатаПодтверждения", ДатаОтправкиПодтверждения);
	
	Сейчас = ТекущаяДатаСеанса();
	Результат = ТребованияФНС.ПредставлениеПодтверждения(Состояние, Сейчас);
	
	Элементы.ДатаПриемаПредставление.Заголовок = Строка(СтроковыеФункции.ФорматированнаяСтрока(Результат.Представление));
	Элементы.ОгонекПодтверждения.Видимость = Ложь;
	Элементы.ГруппаЗаголовкаСроков.Видимость = ТребуетсяПодтверждение;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПредставлениеОтвета()
	
	ДанныеРегистра = ЭлектронныйДокументооборотСФСС.ДанныеРегистраИзвлеченныеДанныеТребованийСФР(Объект.Ссылка);
	ЭтоТребованиеСФРОПредоставленииДокументов = ЭлектронныйДокументооборотСФСС.ЭтоТребованиеСФРОПредоставленииДокументов(Объект);
	ОтветитьДо = Объект.МаксимальнаяДатаОтправкиОтвета;
	Если ЗначениеЗаполнено(ДанныеРегистра.ДатаОтветаИзмененная) Тогда
		ОтветитьДо = ДанныеРегистра.ДатаОтветаИзмененная;
	КонецЕсли;
	
	ДнейДоОтвета = Окр((ОтветитьДо - ТекущаяДатаСеанса()) / 24 / 60 / 60);
	Состояние = Новый Структура;
	Состояние.Вставить("ОсталосьДоОтвета", ДнейДоОтвета);
	Состояние.Вставить("Подтвержден", Истина);
	Состояние.Вставить("ТребуетОтвета", ЭтоТребованиеСФРОПредоставленииДокументов);
	Состояние.Вставить("ОтветУжеДан", ДанныеРегистра.ОтветУжеДан);
	Состояние.Вставить("ЕстьОтвет", КоличествоОтветовВБазе > 0);
	Состояние.Вставить("ОтветитьДо", ОтветитьДо);
	Состояние.Вставить("ДнейДоОтвета", ДнейДоОтвета);
	Состояние.Вставить("КоличествоОтветов", КоличествоОтветовВБазе);
	Состояние.Вставить("ДатаОтвета", Объект.ДатаОтправкиОтветаНаЗапрос);
	Состояние.Вставить("ЕстьОтправленныеОтветы", Состояние.ЕстьОтвет
		И ЗначениеЗаполнено(Состояние.ДатаОтвета));
	Состояние.Вставить("ОтветНеПринят", Объект.ОшибкиЛогическогоКонтроля.Количество() > 0);
	
	Сейчас = ТекущаяДатаСеанса();
	Результат = ТребованияФНС.ПредставлениеОтвета(Состояние, Сейчас);
	
	Элементы.ПоказатьОтветы.Видимость = Результат.ПоказатьОтветы;
	Элементы.ПоказатьОтветы.Заголовок = Результат.ПредставлениеСсылки;
	Элементы.ГиперссылкаОтветы.Видимость = Результат.ПоказатьОтветы;
	Элементы.ДатаОтветаПредставление.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(Результат.Представление);
	Элементы.ОгонекОтвета.Видимость = Результат.ДобавитьОгонек;
	Элементы.ИзменитьДатуОтвета.Видимость = Состояние.Подтвержден
		И НЕ Состояние.ЕстьОтправленныеОтветы;

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПриемПослеВопросаОПовторе(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Обработчик = Новый ОписаниеОповещения("ПодтвердитьПриемПослеПодтверждениеПолучения", ЭтотОбъект);
		ЭлектронныйДокументооборотСФССКлиент.ОтправитьПодтверждениеОПолученииСообщенийСЭДО(
			Обработчик, Объект.Организация, Объект.ИдентификаторСообщения, Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПриемПослеПодтверждениеПолучения(РезультатОтправки, ДополнительныйПараметры) Экспорт
	
	Контекст = Новый Структура;
	
	// Чтение результатов отправки.
	Если РезультатОтправки <> Неопределено Тогда
		Если РезультатОтправки.Свойство("ОписаниеОшибки") И ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки);
		КонецЕсли;
		Если РезультатОтправки.Свойство("Выполнено") И РезультатОтправки.Выполнено Тогда
			Если ДокументТребуетОтвета(Объект.ТипСообщения)
				И ТекущаяДата() <= Объект.МаксимальнаяДатаПодтверждения Тогда
				Объект.МаксимальнаяДатаОтправкиОтвета = МаксимальнаяДатаОтвета(Объект.ВходящаяДата, Объект.МаксимальнаяДатаПодтверждения);
			КонецЕсли;
			Объект.ДатаОтправкиПодтверждения = ТекущаяДата();
			Объект.Статус = "Получено";
			Если ПолучитьОтправленныеОтветы() > 0 Тогда
				Объект.Статус = "Отправлено";
			КонецЕсли;
			Записать();
			УправлениеФормой(ЭтаФорма);
			ОформитьПредставлениеПодтверждения();
			ОформитьПредставлениеОтвета();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СфомироватьОтветНаСервере(Ссылка)
	
	Результат = Неопределено;
	
	Попытка
		Ответ = Документы.ОтветСтрахователяНаТребованиеПроверкиФСС.СоздатьДокумент();
		
		Ответ.Дата 		= ТекущаяДатаСеанса();
		Ответ.Основание	= Ссылка;
		
		Ответ.УстановитьВремя();
		Ответ.УстановитьНовыйНомер();
		
		Ответ.Заполнить(Ссылка);
		
		Ответ.Записать();
		
		Результат = Ответ.Ссылка;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Невозможно сформировать ответ.'"));
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьКоличествоОтветовНаТребованиеФСС(Ссылка)
	
	КоличествоОтветов = ПолучитьОтветыНаТребованиеФСС(Ссылка);
	КоличествоОтветов = ?(КоличествоОтветов = Неопределено, 0, КоличествоОтветов.Количество());
	Возврат КоличествоОтветов;
	
КонецФункции

&НаСервере
Функция ПолучитьОтветыНаТребованиеФСС(Ссылка)
	
	МассивОтветов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ОтветСтрахователяНаТребованиеПроверкиФСС.Ссылка КАК Ответ
	               |ИЗ
	               |	Документ.ОтветСтрахователяНаТребованиеПроверкиФСС КАК ОтветСтрахователяНаТребованиеПроверкиФСС
	               |ГДЕ
	               |	ОтветСтрахователяНаТребованиеПроверкиФСС.Основание = &Основание
	               |	И ОтветСтрахователяНаТребованиеПроверкиФСС.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивОтветов;
	Иначе
		Выгрузка = РезультатЗапроса.Выгрузить();
		
		МассивОтветов = Выгрузка.ВыгрузитьКолонку("Ответ");
	КонецЕсли;
	
	Возврат МассивОтветов;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбновитьОтправкуПослеПолученияКонтекста", 
		ЭтотОбъект);
		
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьОтправкуПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.КонтекстЭДО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	ОповещениеОбратногоВызова = Новый ОписаниеОповещения("ОбновитьОтправкуПослеПолучения", ЭтотОбъект);
	Организации = Новый Массив;
	Организации.Добавить(Объект.Организация);
	КонтекстЭДОКлиент.ПолучитьВходящиеСообщенияСЭДОФСС(
		ОповещениеОбратногоВызова,
		Организации,
		Истина,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправкуПослеПолучения(Результат, ДополнительныеПараметры) Экспорт
	
	Прочитать();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеНаКнопкуПоказатьОтветыПоТребованию()
	
	КоличествоОтветов = ПолучитьОтветыНаТребованиеФСС(Объект.Ссылка);
	
	Если КоличествоОтветов = Неопределено Тогда
		
		ДлительнаяОтправкаКлиентСервер.ВывестиОшибку(НСтр("ru = 'Ответы отсутствуют'"));
		Возврат;
		
	КонецЕсли;
		
	Если КоличествоОтветов.Количество() > 1 Тогда
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Основание", Объект.Ссылка);
	
		ОткрытьФорму(
			"Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.ОтветыНаТребованияФСС",
			ДополнительныеПараметры,,
			Новый УникальныйИдентификатор);
		
	Иначе
		
		ПоказатьЗначение(, КоличествоОтветов[0]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтправленныеОтветы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УведомленияОПриемеОтказе.ОтветНаТребованиеФСС КАК ОтветНаТребованиеФСС
	|ИЗ
	|	Документ.ВходящийДокументСЭДОФСС.УведомленияОПриемеОтказе КАК УведомленияОПриемеОтказе
	|ГДЕ
	|	УведомленияОПриемеОтказе.Ссылка = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	Возврат Выгрузка.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьОшибкиОтветов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтветСтрахователяНаТребованиеПроверкиФСС.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОтветы
	|ИЗ
	|	Документ.ОтветСтрахователяНаТребованиеПроверкиФСС КАК ОтветСтрахователяНаТребованиеПроверкиФСС
	|ГДЕ
	|	ОтветСтрахователяНаТребованиеПроверкиФСС.Основание = &Основание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтветСтрахователяНаТребованиеПроверкиФСС.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОшибкиЛогическогоКонтроля.СодержимоеОшибки КАК СодержимоеОшибки
	|ИЗ
	|	ВТОтветы КАК ВТОтветы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийДокументСЭДОФСС.ОшибкиЛогическогоКонтроля КАК ОшибкиЛогическогоКонтроля
	|		ПО ВТОтветы.Ссылка = ОшибкиЛогическогоКонтроля.ОтветНаТребованиеФСС";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрахователя(ИдентификаторСообщения)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВходящиеСообщенияСЭДОФСС.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ВходящиеСообщенияСЭДОФСС КАК ВходящиеСообщенияСЭДОФСС
	|ГДЕ
	|	ВходящиеСообщенияСЭДОФСС.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСообщения);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Организация = Выборка.Организация;
		Записать();
		Прочитать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлПриложения(Знач ПараметрыПоиска = Неопределено)
	
	ФайлСсылка = Объект.ВходящийФайл;
	
	Если Объект.ФайлыПриложений.Количество() = 0 Тогда
		Возврат ФайлСсылка;
	КонецЕсли;
	
	// Параметры по умолчанию
	ПараметрыПоУмолчанию = Новый Структура;
	ПараметрыПоУмолчанию.Вставить("ПриоритетныйВидФайла", Объект.ВидДокументаФСС);
	ПараметрыПоУмолчанию.Вставить("ИскатьПоПрефиксу", Истина);
	
	// Обновление параметров из входных данных
	Если ПараметрыПоиска <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ПараметрыПоиска);
	КонецЕсли;
	ПараметрыПоиска = ПараметрыПоУмолчанию;
	
	ПрефиксПечатнойФормы = ПрефиксИмениФайлаПечатнойФормы();
	ВидФайлаПечатнойФормы = ПрефиксПечатнойФормы + " " + Объект.ВидДокументаФСС;
	ВидДляСравнения = НРег(СокрЛП(ПараметрыПоиска.ПриоритетныйВидФайла));
	
	Для Каждого ДанныеФайла Из Объект.ФайлыПриложений Цикл
		ТекущийВидФайла = ДанныеФайла.ВидФайла;
		
		// Нормализация вида файла
		ВидФайлаПриложения = СтрЗаменить(НРег(ТекущийВидФайла), НРег(ПрефиксПечатнойФормы), "");
		ВидФайлаПриложения = СокрЛП(ВидФайлаПриложения);
		
		Если ПараметрыПоиска.ИскатьПоПрефиксу Тогда
			УсловиеПоиска = СтрНачинаетсяС(ВидФайлаПриложения, ВидДляСравнения)
			Или ТекущийВидФайла = ВидФайлаПечатнойФормы
			Или ВидФайлаПриложения = ВидДляСравнения;
		Иначе
			УсловиеПоиска = ВидФайлаПриложения = ВидДляСравнения
			Или ТекущийВидФайла = ВидФайлаПечатнойФормы;
		КонецЕсли;
		
		Если УсловиеПоиска Тогда
			ФайлСсылка = ДанныеФайла.ФайлПриложения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ФайлСсылка;
	
КонецФункции

&НаСервере
Процедура ИзменитьДатуОтветаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Истина Тогда
		ОформитьПредставлениеОтвета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксИмениФайлаПечатнойФормы()
	
	Возврат ЭлектронныйДокументооборотСФССКлиентСервер.ПрефиксИмениФайлаПечатнойФормыДокументаДоходнойЧастиСЭДО();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПриложенияКОсновномуДокументу(Знач Объект)
	
	Приложения = Новый Массив;
	
	ПрефиксИмениФайлаПечатнойФормы = ПрефиксИмениФайлаПечатнойФормы();
	Для каждого ТекущийФайл из Объект.ФайлыПриложений Цикл
		Если НЕ СтрНачинаетсяС(ТекущийФайл.ИмяФайла, ПрефиксИмениФайлаПечатнойФормы)
			И НЕ ТекущийФайл.ВидФайла = Объект.ВидДокументаФСС Тогда
			РеквизитыФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ТекущийФайл.ФайлПриложения, "Размер, Расширение");
			Приложение = Новый Структура("ИмяФайла, Размер, Расширение, ПредставлениеФайла, СсылкаНаФайл");
			Приложение.СсылкаНаФайл = ТекущийФайл.ФайлПриложения;
			ЗаполнитьЗначенияСвойств(Приложение, ТекущийФайл);
			ЗаполнитьЗначенияСвойств(Приложение, РеквизитыФайла);
			ИмяФайлаПриложения	= ТекущийФайл.ИмяФайла + "." + РеквизитыФайла.Расширение;
			Шаблон = НСтр("ru='%1 (%2)'");
			ПредставлениеРазмера = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ТекстовоеПредставлениеРазмераФайла(
				РеквизитыФайла.Размер);
			Приложение.ПредставлениеФайла = СтрШаблон(Шаблон, ИмяФайлаПриложения, ПредставлениеРазмера);
			Приложения.Добавить(Приложение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Приложения;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВложенныйФайл(СсылкаНаФайл)
	
	ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(СсылкаНаФайл,
		ЭтотОбъект.УникальныйИдентификатор, Истина);
		
	РасширениеPDF = "pdf";
	Если ВРег(ДанныеФайла.Расширение) = ВРег(РасширениеPDF)
		И НЕ ЭлектронныйДокументооборотСФССКлиент.ЭтоФайлPDF(ДанныеФайла) Тогда
		ТекстСообщения = ОшибкаНеверногоФорматаPDF();
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
			
КонецПроцедуры

&НаКлиенте
Функция ОшибкаНеверногоФорматаPDF()
	
	Возврат НСтр("ru = 'Открыть файл с вложением невозможно. С сервера СФР получен некорректный файл pdf.'");
	
КонецФункции

&НаСервере
Процедура ИнициализироватьВыводСтатусовИВажныхСообщений_85()

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.УстановитьРазмещениеНаименованияЭтапаБРО_85(ЭтотОбъект);
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере() Экспорт

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДетальноеОписаниеСтатусаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат = "ОбновитьОтправку" Тогда
		
		ОбновитьОтправку(Неопределено);
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСтатусыИВыжныеСообщенияНаФорму() Экспорт

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияКнопкиВВажномСообщении(Команда)

	Если Команда.Имя = "ОтправитьНеотправленноеИзвещение" Тогда
		КомандаПодтвердитьПрием(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылкиВВажномСообщении(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаЗакрытияВажногоСообщения(Команда)

	МодульКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер");
	МодульКлиентСервер.ЗакрытьВажноеСообщение(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)

	МодульОбщегоНазначенияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиент");
	МодульОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДокументТребуетОтвета(ТипСообщения)
	
	Возврат ЭлектронныйДокументооборотСФССКлиентСервер.ДокументДоходнойЧастиСЭДОТребуетОтвета(ТипСообщения);
	
КонецФункции

&НаСервереБезКонтекста
Функция МаксимальнаяДатаОтвета(ВходящаяДата, ДатаПодтверждения)
	
	Результат = Неопределено;
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Если НЕ КонтекстЭДО = Неопределено Тогда
		Результат = КонтекстЭДО.МаксимальнаяДатаОтветаНаТребованиеСФРПоДатеПодтверждения(ВходящаяДата, ДатаПодтверждения);
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось получить контекст ЭДО с КО.'");;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
